k6-logs/test-script.txt
          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


     data_received..................: 1.1 MB 36 kB/s
     data_sent......................: 36 kB  1.2 kB/s
     http_req_blocked...............: avg=12.47ms  min=209ns   med=2.2µs    max=428.18ms p(90)=4.79µs   p(95)=7.79µs  
     http_req_connecting............: avg=1.03ms   min=0s      med=0s       max=36.53ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=26.41ms  min=15.41ms med=24.6ms   max=207.14ms p(90)=32.68ms  p(95)=34.99ms 
       { expected_response:true }...: avg=26.41ms  min=15.41ms med=24.6ms   max=207.14ms p(90)=32.68ms  p(95)=34.99ms 
     http_req_failed................: 0.00%  ✓ 0         ✗ 560 
     http_req_receiving.............: avg=499.91µs min=19.83µs med=170.41µs max=9.33ms   p(90)=482.74µs p(95)=1.65ms  
     http_req_sending...............: avg=572.6µs  min=23.95µs med=159.97µs max=23.38ms  p(90)=331.52µs p(95)=415.85µs
     http_req_tls_handshaking.......: avg=1.64ms   min=0s      med=0s       max=63.73ms  p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=25.34ms  min=15.3ms  med=24.08ms  max=206.44ms p(90)=31.53ms  p(95)=33.5ms  
     http_reqs......................: 560    18.263137/s
     iteration_duration.............: avg=1.08s    min=1.04s   med=1.05s    max=1.84s    p(90)=1.06s    p(95)=1.07s   
     iterations.....................: 280    9.131568/s
     vus............................: 10     min=10      max=10
     vus_max........................: 10     min=10      max=10